Autodesk.Revit.DB.Architecture.TopographyLinkType.ReloadInternal(System.String,System.Boolean)
Reloads the link from curently-stored location.
path:
The path of the link file.
isFromAPI:
True if this method is called by API, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to reload the type.
Since:
2019.2